#Задание 1

name = "Анна"
age = "30"
print("Привет, меня зовут", name, "и мне", age, "лет\n")
name_1 = input("Введите Ваше имя: ")
age_1 = int(input("Введите Ваш возраст цифрами: "))
experience = input("Укажите стаж работы: ")
print("Вас зовут", name_1, "и вам", age_1, "лет,\n", "стаж работы:", experience, "\n")
print("Приятно познакомиться,", name_1, "!")
